ТОИР_демо/src/InformationRegisters/торо_СтатусыСогласованияДокументовРемонтныхРабот/торо_СтатусыСогласованияДокументовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыСогласованияДокументовРемонтныхРабот</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НеНапоминать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      <types>DocumentRef.торо_АктПриемкиОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ТекущиеСтатусыДокументов/торо_ТекущиеСтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущиеСтатусыДокументов</name>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      <types>DocumentRef.торо_АктПриемкиОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_МатрицаПереходаСтатусовДокументов/торо_МатрицаПереходаСтатусовДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МатрицаПереходаСтатусовДокументов</name>
  <resources>
    <name>Начальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СогласованиеЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонСообщенияЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПодборах</name>
    <comment>Не выводить ремонтные работы в форме подбора для документов, имеющих соответствующий статус</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СледующийСтатус</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ВидыДокументовСогласования/торо_ВидыДокументовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВидыДокументовСогласования</name>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.торо_ВидыДокументовСогласованияМероприятий</types>
      <types>EnumRef.торо_ВидыДокументовСогласованияРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регламентный</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ТекущиеСогласующиеДокументов/торо_ТекущиеСогласующиеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ТекущиеСогласующиеДокументов</name>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      <types>DocumentRef.торо_АктПриемкиОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Замещающий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/InformationRegisters/торо_ИсторияСтатусовДокументов/торо_ИсторияСтатусовДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИсторияСтатусовДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      <types>DocumentRef.торо_АктПриемкиОборудования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаКого</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТОИР_демо/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ТОИР_демо/src/CommonModules/торо_Согласования/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// торо_Согласования: методы, реализующие одноименную функциональность
//
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Функция добавляет статусы согласования по документуъ
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка - ссылка на документ.
//  ДополнительныеСвойства - Структура - доп. свойства.
Процедура ДобавитьСтатусыСогласованияПоДокументу(СсылкаНаДокумент, ДополнительныеСвойства = Неопределено) Экспорт
	
	// Заполним таблицу согласующих.
	ТаблицаСогласующих = Новый ТаблицаЗначений;
	ТаблицаСогласующих.Колонки.Добавить("Согласующий", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	// Дополнительные свойства заполняются на форме перед записью документа.
	// В регистрах информация на этот момент может быть устаревшая, т.к. 
	// событие ПриЗаписи в форме документа (когда выполняется запись в регистры)
	// срабатывает после событий ПриЗаписи и ОбработкаПроведения в модуле объекта.
	// Но если запись выполнялась не из формы, то берем, что есть в регистрах.
	Если ДополнительныеСвойства <> Неопределено Тогда
		
		Если ДополнительныеСвойства.Свойство("СтатусДокумента") Тогда
			СтатусДокумента = ДополнительныеСвойства.СтатусДокумента;
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("Согласующие") Тогда
			СогласующиеДокумента = ДополнительныеСвойства.Согласующие;
		КонецЕсли;
		
	Иначе
		СтатусДокумента = ПолучитьТекущийСтатусСогласованияДокумента(СсылкаНаДокумент);
		СогласующиеДокумента = ПолучитьТаблицуСогласующихДокумента(СсылкаНаДокумент);
	КонецЕсли;

	
	ДеревоСогласования = торо_Ремонты.ПолучитьДеревоСогласования(СсылкаНаДокумент.СпособСогласования, СтатусДокумента, СогласующиеДокумента);
	
	Для Каждого СтрокаСтатусов Из ДеревоСогласования.Строки Цикл
		
		Для Каждого СтрокаСогласующих Из СтрокаСтатусов.Строки Цикл
			
			НовСтрокаТЗ = ТаблицаСогласующих.Добавить();
			НовСтрокаТЗ.Согласующий = СтрокаСогласующих.Согласующий;
			
			Для Каждого СтрокаЗамещающих Из СтрокаСогласующих.Строки Цикл
				
				НовСтрокаТЗ = ТаблицаСогласующих.Добавить();
				НовСтрокаТЗ.Согласующий = СтрокаЗамещающих.Замещающий;
				
			КонецЦикла; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	ТаблицаСогласующих.Свернуть("Согласующий");
	ТаблицаСогласующих.Колонки.Добавить("Дата"         , Новый ОписаниеТипов("Дата"));
	ТаблицаСогласующих.Колонки.Добавить("НеНапоминать" , Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаСогласующих Из ТаблицаСогласующих Цикл
		
		ОтключитьОповещение = Истина;
		
		// Этап 1 Проход по согласовавшим
		МассивСтрокСогласовавших = ДеревоСогласования.Строки.НайтиСтроки(Новый Структура("Согласующий, Замещающий", 
		СтрокаСогласующих.Согласующий, Справочники.Пользователи.ПустаяСсылка()), Истина);
		
		Для Каждого ЭлементМС Из МассивСтрокСогласовавших Цикл
			
			Если Не ЭлементМС.Согласовано Тогда
				
				ЕстьСогласованные = Ложь;
				Для Каждого СтрокаЗамещения Из ЭлементМС.Строки Цикл
					
					Если СтрокаЗамещения.Согласовано Тогда
						
						ЕстьСогласованные = Истина;
						Прервать;
						
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если Не ЕстьСогласованные Тогда
					
					ОтключитьОповещение = Ложь;
					Прервать;
					
				КонецЕсли; 
				
			КонецЕсли; 	
			
		КонецЦикла; 		
		
		Если Не ОтключитьОповещение Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		// Этап №2 Проход по замещающим
		МассивСтрокЗамещающих = ДеревоСогласования.Строки.НайтиСтроки(Новый Структура("Замещающий",
		СтрокаСогласующих.Согласующий), Истина);
		
		Для Каждого ЭлементМЗ Из МассивСтрокЗамещающих Цикл
			
			Если (Не ЭлементМЗ.Согласовано) И (Не ЭлементМЗ.Родитель.Согласовано) Тогда
				
				ЕстьСогласованные = Ложь;
				Для Каждого СтрокаЗамещения Из ЭлементМЗ.Родитель.Строки Цикл
					
					Если СтрокаЗамещения.Согласовано Тогда
						
						ЕстьСогласованные = Истина;
						Прервать;
						
					КонецЕсли; 
					
				КонецЦикла; 
				
				Если Не ЕстьСогласованные Тогда
					
					ОтключитьОповещение = Ложь;
					Прервать;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;
		
		Если Не ОтключитьОповещение Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаСогласующих.Дата = ТекущаяДата();
		СтрокаСогласующих.НеНапоминать = Истина;
		
	КонецЦикла; 
	
	
	НаборЗаписейСогласования = РегистрыСведений.торо_СтатусыСогласованияДокументовРемонтныхРабот.СоздатьНаборЗаписей();
	НаборЗаписейСогласования.Отбор.Документ.Установить(СсылкаНаДокумент);
	НаборЗаписейСогласования.Записать();
	
	НаборЗаписейСогласования.Отбор.Статус.Установить(СтатусДокумента);
	НаборЗаписейСогласования.Отбор.Организация.Установить(СсылкаНаДокумент.Организация);
	
	Для Каждого СтрокаТЗ Из ТаблицаСогласующих Цикл
		
		НоваяЗапись = НаборЗаписейСогласования.Добавить();
		НоваяЗапись.Организация  = СсылкаНаДокумент.Организация;
		НоваяЗапись.Документ     = СсылкаНаДокумент;
		НоваяЗапись.Пользователь = СтрокаТЗ.Согласующий;
		НоваяЗапись.Статус       = СтатусДокумента;
		НоваяЗапись.НеНапоминать = СтрокаТЗ.НеНапоминать;
		НоваяЗапись.Дата         = СтрокаТЗ.Дата;
		
	КонецЦикла;
	
	НаборЗаписейСогласования.Записать();
	
КонецПроцедуры

// Функция возвращает массив ссылок документов, находящихся в статусе, по которому не запрещен отбор,
// либо не указан способ согласования (для случая, когда на момент включения системы 
// согласования уже были введены некоторые документы), 
// либо система согласования для данного вида документов не используется.
//
// Параметры:
//  ТипДокумента - Строка - Название документа из конфигуратора.
//
// Возвращаемое значение:
//  Массив - массив ссылок на документы.
Функция ПолучитьСписокДоступныхДокументов(ТипДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
				   
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_ТекущиеСтатусыДокументов.Документ КАК Ссылка,
	|	торо_ТекущиеСтатусыДокументов.СтатусДокумента,
	|	ВЫРАЗИТЬ(торо_ТекущиеСтатусыДокументов.Документ КАК Документ."	+ ТипДокумента + ").СпособСогласования КАК СпособСогласования
	|ИЗ
	|	РегистрСведений.торо_ТекущиеСтатусыДокументов КАК торо_ТекущиеСтатусыДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_МатрицаПереходаСтатусовДокументов КАК торо_МатрицаПереходаСтатусовДокументов
	|		ПО торо_ТекущиеСтатусыДокументов.СтатусДокумента = торо_МатрицаПереходаСтатусовДокументов.ТекущийСтатус
	|			И (ВЫРАЗИТЬ(торо_ТекущиеСтатусыДокументов.Документ КАК Документ."	+ ТипДокумента + ").СпособСогласования = торо_МатрицаПереходаСтатусовДокументов.СпособСогласования)
	|ГДЕ
	|	торо_ТекущиеСтатусыДокументов.Документ ССЫЛКА Документ."	+ ТипДокумента + "
	|	И торо_МатрицаПереходаСтатусовДокументов.НеИспользоватьВПодборах";

	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	

// Функция проверяет, используется ли система согласования для документов данного типа.
//
// Параметры:
//  ИмяТипа - ПеречислениеСсылка.торо_ВидыДокументовСогласованияРемонтов - тип документа.
//  Регламентный - Булево - это документ регламентного мероприятия.
// Возвращаемое значение:
//  Булево - для документа включено согласование.
Функция ПроверитьИспользованиеСогласованияДокументов(Знач ИмяТипа = "", Регламентный = Ложь) Экспорт
	
	ФОИспользоватьСогласование = ПолучитьФункциональнуюОпцию("торо_ИспользоватьСогласование");
	КонстантаРемонты = Константы.торо_ИспользоватьСогласованиеДокументовРемонтов.Получить();
	КонстантаМероприятия = Константы.торо_ИспользоватьСогласованиеДокументовМероприятий.Получить();
	Если ИмяТипа = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ОстановочныеРемонты 
			или ИмяТипа = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_АктПриемкиОборудования
			Тогда
		докСогласованиеИспользуется = Ложь;
	Иначе		
		докСогласованиеИспользуется = Константы.ИспользоватьИнтеграциюС1СДокументооборот.Получить() И Константы.ИспользоватьПроцессыИЗадачи1СДокументооборота.Получить();
	КонецЕсли;
	
	Если НЕ ФОИспользоватьСогласование ИЛИ (НЕ КонстантаРемонты И НЕ КонстантаМероприятия) Тогда
		Возврат Ложь;
	ИначеЕсли ИмяТипа = "" Тогда
		Возврат НЕ докСогласованиеИспользуется;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	торо_ВидыДокументовСогласования.ВидДокумента КАК ВидДокумента
		|ИЗ
		|	РегистрСведений.торо_ВидыДокументовСогласования КАК торо_ВидыДокументовСогласования
		|ГДЕ
		|	торо_ВидыДокументовСогласования.ВидДокумента = &ВидДокумента";
		
		// В случае формирования уведомлений передается строка с именем документа. На всякий случай возьмем в попытку.
		Попытка
			ИмяТипа = ?(ТипЗнч(ИмяТипа) = Тип("Строка"),?(Регламентный, Вычислить("Перечисления.торо_ВидыДокументовСогласованияМероприятий." + ИмяТипа),Вычислить("Перечисления.торо_ВидыДокументовСогласованияРемонтов." + ИмяТипа)),ИмяТипа);
		Исключение
			// Значит документ с таким именем не участвует в согласованиях и можем спокойно возвращать ложь.
			Возврат Ложь;
		КонецПопытки;
		Запрос.УстановитьПараметр("ВидДокумента", ИмяТипа);
		
		Результат = запрос.Выполнить();
		// согласование по документу используется
		Если Не Результат.Пустой() Тогда
			Возврат ?(Регламентный,КонстантаМероприятия,КонстантаРемонты) И НЕ докСогласованиеИспользуется;
		// согласование по документу не используется	
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Функция возвращает статус согласования документа из регистра торо_ТекущиеСтатусыДокументов.
// Параметры:
//  Документ - ДокументСсылка - документ, для которого получается статус.
// Возвращаемое значение:
//  СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот - статус согласования.
Функция ПолучитьТекущийСтатусСогласованияДокумента(Документ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ТекущиеСтатусыДокументов.Документ,
	|	торо_ТекущиеСтатусыДокументов.СтатусДокумента
	|ИЗ
	|	РегистрСведений.торо_ТекущиеСтатусыДокументов КАК торо_ТекущиеСтатусыДокументов
	|ГДЕ
	|	торо_ТекущиеСтатусыДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусДокумента;
	КонецЕсли;
	
	Возврат Справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка();
	
КонецФункции

// Функция возвращает список лиц, уже согласовавших документ на последней итерации.
// Параметры:
//  Документ - ДокументСсылка - документ, для которого получается статус.
// Возвращаемое значение:
//  ТаблицаЗначений - таблица согласующих.
Функция ПолучитьТаблицуСогласующихДокумента(Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ТекущиеСогласующиеДокументов.СтатусДокумента,
	|	торо_ТекущиеСогласующиеДокументов.Согласующий,
	|	торо_ТекущиеСогласующиеДокументов.Замещающий,
	|	торо_ТекущиеСогласующиеДокументов.Согласовано
	|ИЗ
	|	РегистрСведений.торо_ТекущиеСогласующиеДокументов КАК торо_ТекущиеСогласующиеДокументов
	|ГДЕ
	|	торо_ТекущиеСогласующиеДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции

// Возвращает ключ записи регистра сведений торо_ИсторияСтатусовДокументов по структуре ключевых полей.
//
// Параметры:
//		СтруктураКлюча - Структура - Структура с полями, соответствующмими измерениям регистра.
// Возвращаемое значение:
//		РегистрСведенийКлючЗаписи.торо_ИсторияСтатусовДокументов - ключ записи. 
Функция ПолучитьКлючЗаписиИсторииСтатусовДокументов(СтруктураКлюча) Экспорт
	
	Возврат РегистрыСведений.торо_ИсторияСтатусовДокументов.СоздатьКлючЗаписи(СтруктураКлюча);
		
КонецФункции

// Возвращает комментарий к статусу согласования из записи регистра сведений торо_ИсторияСтатусовДокументов,
// определяемой по значениям измерений, переданных в параметре.
//
// Параметры:
//		СтруктураКлюча - Структура - Структура с полями, соответствующмими измерениям регистра.
// Возвращаемое значение:
//		Строка - текст комментария к статусу согласования. 
Функция ПолучитьКомментарийКСтатусуСогласования(СтруктураКлюча) Экспорт
	
	Запись = РегистрыСведений.торо_ИсторияСтатусовДокументов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураКлюча);
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Комментарий;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
